Ortho_App/data/Master_cfd_file/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

#include "pvfr.txt"
//$vfr
//
// txtfile
//vfr 1e+05;
//#inputMode merge

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        massFlowRate    constant $vfr;
        rhoInlet        1.122;          // estimate for initial rho
    }

    wall
    {
        type            noSlip;
    }

    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
